Tekla Open API Reference for Tekla Structures 2025
PluginBase.SymbolVisibility Enumeration
 Defines the symbol visibility for model plug-ins in model views.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SymbolVisibility
Public Enumeration SymbolVisibility
Members
Member name | Value | Description
DRAW_SYMBOL | 0 |  Symbol is visible in model view.
DO_NOT_DRAW_SYMBOL | 1 |  Symbol is not drawn to model view. Plug-in must be selected from the view using created objects only.
See Also
Reference
Tekla.Structures.Plugins Namespace